renesas/amazon-freertos/demos/renesas/rx65n-rsk-uart-esp32/e2studio/ccrx/boot_loader/src/smc_gen/r_usb_hmsc/src/r_usb_hmsc_driver.c
uint32_t    g_usb_hmsc_cmd_data_length[USB_NUM_USBIP];

/******************************************************************************
 Exported global variables
 ******************************************************************************/
#if (BSP_CFG_RTOS_USED == 1)
extern SemaphoreHandle_t    SemaphoreHandleRead;
#endif /*BSP_CFG_RTOS_USED == 1 */

/******************************************************************************
 Exported global variables (to be accessed by other files)
 ******************************************************************************/

const uint16_t g_usb_hmsc_devicetpl[] =
{
    USB_CFG_TPLCNT,        /* Number of tpl table */
    0,                  /* Reserved */
    USB_CFG_TPL             /* Vendor ID, Product ID */
};

usb_pipe_table_reg_t    g_usb_hmsc_pipe_table[USB_MAXSTRAGE][USB_PIPE_DIR_MAX];

drive_management_t g_usb_hmsc_drvno_tbl[USB_MAXSTRAGE]; /* Drive no. management table */
uint16_t g_usb_hmsc_out_pipe[USB_NUM_USBIP][USB_MAXSTRAGE]; /* Pipenumber */
uint16_t g_usb_hmsc_in_pipe[USB_NUM_USBIP][USB_MAXSTRAGE]; /* Pipenumber */
uint16_t g_usb_hmsc_out_pipectr[USB_NUM_USBIP][USB_MAXSTRAGE]; /* Pipectr(SQTGL) */
uint16_t g_usb_hmsc_in_pipectr[USB_NUM_USBIP][USB_MAXSTRAGE]; /* Pipectr(SQTGL) */
usb_msc_cbw_t g_usb_hmsc_cbw[USB_NUM_USBIP][USB_MAXSTRAGE]; /* CBW headder */
usb_msc_csw_t g_usb_hmsc_csw[USB_NUM_USBIP][USB_MAXSTRAGE]; /* CSW headder */
uint32_t g_usb_hmsc_csw_tag_no[USB_NUM_USBIP][USB_MAXSTRAGE]; /* CBW tag number */
uint8_t g_usb_hmsc_sub_class[USB_NUM_USBIP][USB_MAXSTRAGE];
uint8_t g_usb_hmsc_tmp_sub_class[USB_NUM_USBIP];

uint16_t g_usb_hmsc_init_seq[USB_NUM_USBIP];

uint8_t *g_p_usb_hmsc_device_table[USB_NUM_USBIP];
uint8_t *g_p_usb_hmsc_config_table[USB_NUM_USBIP];
uint8_t *g_p_usb_hmsc_interface_table[USB_NUM_USBIP];
uint16_t g_usb_hmsc_devaddr[USB_NUM_USBIP];

usb_utr_t g_usb_hmsc_class_control[USB_NUM_USBIP];
uint8_t g_usb_hmsc_class_data[USB_NUM_USBIP][USB_HMSC_CLSDATASIZE];

uint16_t g_usb_shmsc_data_stall_seq[USB_NUM_USBIP];
uint16_t g_usb_hmsc_speed[USB_NUM_USBIP];

#if (BSP_CFG_RTOS_USED == 0)
uint8_t g_drive_search_que[USB_MAXSTRAGE];
uint8_t g_drive_search_que_cnt;
uint8_t g_drive_search_lock;
#endif  /* BSP_CFG_RTOS_USED == 0 */

/******************************************************************************
 Renesas Abstracted HMSC Driver functions
 ******************************************************************************/

#if (BSP_CFG_RTOS_USED == 0)
/******************************************************************************
 Function Name   : usb_hmsc_task
 Description     : USB HMSC Task
 Arguments       : none
 Return value    : none
 ******************************************************************************/
void usb_hmsc_task (void)
{
    usb_utr_t *pmess;
    usb_er_t err;

    /* Receive message */
    err = USB_RCV_MSG(USB_HMSC_MBX, (usb_msg_t** )&pmess);
    if (USB_OK != err)
    {
        return;
    }

    switch (pmess->msginfo)
    {
        case USB_MSG_CLS_INIT :
            usb_hmsc_enumeration(pmess);
        break;
        case USB_MSG_HMSC_NO_DATA :
        case USB_MSG_HMSC_DATA_IN :
        case USB_MSG_HMSC_DATA_OUT :
            usb_hmsc_data_act(pmess);
        break;
        case USB_MSG_HMSC_CBW_ERR :
        case USB_MSG_HMSC_CSW_PHASE_ERR :
            usb_hmsc_stall_err(pmess);
        break;
        default :
        break;
    }
    err = USB_REL_BLK(USB_HMSC_MPL, (usb_mh_t )pmess);
    if (USB_OK != err)
    {
        USB_PRINTF0("### USB hmsc Task rel_blk error\n");
    }
}
/******************************************************************************
 End of function usb_hmsc_task
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_enumeration
 Description     : check class
 Arguments       : usb_utr_t *mess   : Pointer to usb_utr_t structure.
 Return value    : none
 ******************************************************************************/
static void usb_hmsc_enumeration (usb_utr_t *mess)
{
    uint16_t retval;
    uint16_t result;
    uint16_t iproduct;

    result = USB_OK;
    switch (g_usb_hmsc_init_seq[mess->ip])
    {
        case USB_SEQ_0 :

            /* Check Interface Descriptor (deviceclass) */
            if (USB_IFCLS_MAS != g_p_usb_hmsc_interface_table[mess->ip][USB_IF_B_INTERFACECLASS])
            {
                USB_PRINTF1("### Interface deviceclass is %x , not support.\n",
                        g_usb_hmsc_interface_table[mess->ip][USB_IF_B_INTERFACECLASS]);
                result = USB_ERROR;
            }

            /* Check Interface Descriptor (subclass) */
            g_usb_hmsc_tmp_sub_class[mess->ip] = g_p_usb_hmsc_interface_table[mess->ip][USB_IF_B_INTERFACESUBCLASS];
            if (USB_ATAPI == g_usb_hmsc_tmp_sub_class[mess->ip])
            {
                USB_PRINTF0("    Interface subclass  : SFF-8070i\n");
            }
            else if (USB_SCSI == g_usb_hmsc_tmp_sub_class[mess->ip])
            {
                USB_PRINTF0(
                        "Interface subclass  : SCSI transparent command set\n");
            }
            else if (USB_ATAPI_MMC5 == g_usb_hmsc_tmp_sub_class[mess->ip])
            {
                USB_PRINTF0("   Interface subclass   : ATAPI command set\n");
            }
            else
            {
                USB_PRINTF1("### Interface subclass is %x , not support.\n", g_usb_hmsc_tmp_sub_class[mess->ip]);
                result = USB_ERROR;
            }

            /* Check Interface Descriptor (protocol) */
            if (USB_BOTP == g_p_usb_hmsc_interface_table[mess->ip][USB_IF_B_INTERFACEPROTOCOL])
            {
                USB_PRINTF0("   Interface protocol   : BOT \n");
            }
            else
            {
                USB_PRINTF1("### Interface protocol is %x , not support.\n",
                        g_usb_hmsc_interface_table[mess->ip][USB_IF_B_INTERFACEPROTOCOL]);
                result = USB_ERROR;
            }

            /* Check Endpoint number */
            if (g_p_usb_hmsc_interface_table[mess->ip][USB_IF_B_NUMENDPOINTS] < 2)
            {
                USB_PRINTF1("### Endpoint number is %x , less than 2.\n",
                        g_usb_hmsc_interface_table[mess->ip][USB_IF_B_NUMENDPOINTS]);
                result = USB_ERROR;
            }

            /* Send GetDescriptor(Stirng) */
            if (USB_ERROR != result)
            {
                retval = usb_hmsc_get_string_desc(mess, g_usb_hmsc_devaddr[mess->ip], 0, usb_hmsc_class_check_result);
                g_usb_hmsc_init_seq[mess->ip]++;
            }
        break;

        case USB_SEQ_1 :
            retval = usb_hmsc_std_req_check(mess->result);
            if (USB_ERROR == retval)
            {
                result = USB_ERROR;
            }
            else
            {
                /* Send GetDescriptor(Stirng) */
                iproduct = g_p_usb_hmsc_device_table[mess->ip][USB_DEV_I_PRODUCT];
                retval = usb_hmsc_get_string_desc(mess, g_usb_hmsc_devaddr[mess->ip], iproduct,
                        usb_hmsc_class_check_result);
                g_usb_hmsc_init_seq[mess->ip]++;
            }
        break;

        case USB_SEQ_2 :
            retval = usb_hmsc_std_req_check(mess->result);
            if (USB_ERROR == retval)
            {
                result = USB_ERROR;
            }

            if (USB_ERROR != result)
            {
                /* Return to MGR */
                usb_hstd_return_enu_mgr(mess, retval);
                g_usb_hmsc_init_seq[mess->ip] = USB_SEQ_0;
            }
        break;

        default :
            result = USB_ERROR;
        break;
    }

    if (USB_ERROR == result)
    {
        /* Return to MGR */
        usb_hstd_return_enu_mgr(mess, USB_ERROR);
        g_usb_hmsc_init_seq[mess->ip] = USB_SEQ_0;
        usb_hstd_connect_err_event_set(mess->ip);
    }
}
/******************************************************************************
 End of function usb_hmsc_enumeration
 ******************************************************************************/
#endif /* (BSP_CFG_RTOS_USED == 0) */

