renesas/amazon-freertos/demos/renesas/rx65n-rsk-uart-esp32/e2studio/ccrx/boot_loader/src/smc_gen/r_usb_hmsc/src/r_usb_hmsc_driver.c
    if (USB_ATAPI == g_usb_hmsc_sub_class[ptr->ip][side])
    {
        /* 12bytes */
        g_usb_hmsc_cbw[ptr->ip][side].bcbwcb_length.bcbwcb_length = USB_MSC_CBWCB_LENGTH;
    }
}
/******************************************************************************
 End of function usb_hmsc_set_els_cbw
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_clr_data
 Description     : data clear
 Arguments       : uint16_t len : Clear size
                 : uint8_t *buf : Pointer to the area to clear
 Return value    : none
 ******************************************************************************/
void usb_hmsc_clr_data (uint16_t len, uint8_t *buf)
{
    uint16_t i;

    for (i = 0; i < len; ++i)
    {
        *buf++ = 0x00;
    }
}
/******************************************************************************
 End of function usb_hmsc_clr_data
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_no_data
 Description     : HMSC No data
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure.
                 : uint16_t     side    : Driver number
 Return value    : uint16_t : 
 ******************************************************************************/
uint16_t usb_hmsc_no_data (usb_utr_t *ptr, uint16_t side)
{
#if (BSP_CFG_RTOS_USED)
    uint16_t hmsc_retval;

    ptr->keyword = side;
    usb_shmsc_process[ptr->ip] = USB_MSG_HMSC_NO_DATA;
    hmsc_retval = usb_hmsc_data_act(ptr);

    return (hmsc_retval);
#else /* (BSP_CFG_RTOS_USED) */
    usb_utr_t mess;

    mess.ip = ptr->ip;
    mess.ipp = ptr->ipp;
    mess.keyword = side;
    usb_shmsc_process[ptr->ip] = USB_MSG_HMSC_NO_DATA;
    usb_hmsc_specified_path(&mess);
    usb_shmsc_data_seq[ptr->ip] = USB_SEQ_0;

    return USB_OK;
#endif /* (BSP_CFG_RTOS_USED) */
}
/******************************************************************************
 End of function usb_hmsc_no_data
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_data_in
 Description     : HMSC Data In
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure.
                 : uint16_t     side    : Driver number
                 : uint8_t      *buff   : Pointer to the buffer area
                 : uint32_t     size    : Data size
 Return value    : uint16_t : 
 ******************************************************************************/
uint16_t usb_hmsc_data_in (usb_utr_t *ptr, uint16_t side, uint8_t *buff, uint32_t size)
{
#if (BSP_CFG_RTOS_USED)
    uint16_t hmsc_retval;

    ptr->keyword = side;
    pusb_hmsc_buff[ptr->ip] = buff;
    usb_hmsc_trans_size[ptr->ip] = size;
    usb_shmsc_process[ptr->ip] = USB_MSG_HMSC_DATA_IN;
    hmsc_retval = usb_hmsc_data_act(ptr);

    return (hmsc_retval);
#else /* (BSP_CFG_RTOS_USED) */
    usb_utr_t mess;

    mess.ip = ptr->ip;
    mess.ipp = ptr->ipp;
    mess.keyword = side;
    pusb_hmsc_buff[ptr->ip] = buff;
    usb_hmsc_trans_size[ptr->ip] = size;
    usb_shmsc_process[ptr->ip] = USB_MSG_HMSC_DATA_IN;
    usb_hmsc_specified_path(&mess);
    usb_shmsc_data_seq[ptr->ip] = USB_SEQ_0;

    return USB_OK;
#endif /* (BSP_CFG_RTOS_USED) */
}
/******************************************************************************
 End of function usb_hmsc_data_in
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_data_out
 Description     : HMSC Data Out
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure.
                 : uint16_t     side    : Driver number
                 : uint8_t      *buff   : Pointer to the buffer area
                 : uint32_t     size    : Data size
 Return value    : uint16_t : 
 ******************************************************************************/
uint16_t usb_hmsc_data_out (usb_utr_t *ptr, uint16_t side, uint8_t *buff, uint32_t size)
{
#if (BSP_CFG_RTOS_USED)
    uint16_t hmsc_retval;

    ptr->keyword = side;
    pusb_hmsc_buff[ptr->ip] = buff;
    usb_hmsc_trans_size[ptr->ip] = size;
    usb_shmsc_process[ptr->ip] = USB_MSG_HMSC_DATA_OUT;
    hmsc_retval = usb_hmsc_data_act(ptr);

    return (hmsc_retval);
#else /* (BSP_CFG_RTOS_USED) */
    usb_utr_t mess;

    mess.ip = ptr->ip;
    mess.ipp = ptr->ipp;
    mess.keyword = side;
    pusb_hmsc_buff[ptr->ip] = buff;
    usb_hmsc_trans_size[ptr->ip] = size;
    usb_shmsc_process[ptr->ip] = USB_MSG_HMSC_DATA_OUT;
    usb_hmsc_specified_path(&mess);
    usb_shmsc_data_seq[ptr->ip] = USB_SEQ_0;

    return USB_OK;
#endif /* (BSP_CFG_RTOS_USED) */
}
/******************************************************************************
 End of function usb_hmsc_data_out
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_data_act
 Description     : Send Data request
 Arguments       : usb_utr_t    *mess   : Pointer to usb_utr_t structure.
 Return value    : uint16_t : 
 ******************************************************************************/
static uint16_t usb_hmsc_data_act (usb_utr_t *mess)
{
#if (BSP_CFG_RTOS_USED)
    uint16_t hmsc_retval;
    uint16_t side;
    uint8_t *pbuff;
    uint32_t size;

    side = mess->keyword;
    pbuff = pusb_hmsc_buff[mess->ip];
    size = usb_hmsc_trans_size[mess->ip];

    /* CBW */
    hmsc_retval = usb_hmsc_send_cbw(mess, side);
    if (USB_HMSC_OK != hmsc_retval)
    {
        USB_PRINTF1("### Data :SendCBW error(drive:%d) \n", side);
    }
    else
    {
        if (USB_MSG_HMSC_DATA_IN == usb_shmsc_process[mess->ip]) /* DataIn */
        {
            hmsc_retval = usb_hmsc_get_data(mess, side, pbuff, size);
            if (USB_HMSC_OK != hmsc_retval)
            {
                USB_PRINTF1("### DataIN : GetData error(drive:%d) \n", side);
                usb_hmsc_get_csw(mess, side);
                return USB_HMSC_CSW_ERR;
            }
        }
        else if (USB_MSG_HMSC_DATA_OUT == usb_shmsc_process[mess->ip]) /* DataOut */
        {
            hmsc_retval = usb_hmsc_send_data(mess, side, pbuff, size);
            if (USB_HMSC_OK != hmsc_retval)
            {
                USB_PRINTF1("### DataOUT : SendData error(drive:%d) \n", side);
                usb_hmsc_get_csw(mess, side);
                return USB_HMSC_CSW_ERR;
            }
        }
        else { /* None */ }

        /* CSW */
        hmsc_retval = usb_hmsc_get_csw(mess, side);
        switch (hmsc_retval)
        {
            case USB_HMSC_OK:
            break;
            case USB_HMSC_CSW_ERR:
                USB_PRINTF1("*** Data : CSW-NG(drive:%d) \n", side);
                usb_cpu_delay_xms((uint16_t)200);
            break;
            case USB_HMSC_STALL:
                USB_PRINTF1("*** Data : CSW-STALL(drive:%d) \n", side);
                usb_hmsc_csw_err_stall[mess->ip] = USB_ON;
                g_usb_hmsc_in_pipectr[mess->ip][side] = 0;
                usb_hmsc_clear_stall(mess, g_usb_hmsc_in_pipe[mess->ip][side], class_trans_result);
                hmsc_retval = usb_hmsc_get_csw(mess, side);
            break;
            case USB_MSC_CSW_PHASE_ERR:
                USB_PRINTF1("*** Data : CSW-PhaseError(drive:%d) \n", side);

                /* Reset */
                usb_hmsc_mass_storage_reset(mess, g_usb_hmsc_drvno_tbl[side].devadr, usb_hmsc_trans_result);

                /* Clear STALL for OUT pipe */
                usb_hmsc_clear_stall(mess, g_usb_hmsc_out_pipe[mess->ip][side], class_trans_result);
                g_usb_hmsc_out_pipectr[mess->ip][side] = 0;

