renesas/amazon-freertos/demos/renesas/rx65n-rsk-uart-esp32/e2studio/ccrx/boot_loader/src/smc_gen/r_usb_hmsc/src/r_usb_hmsc_driver.c
                        /* Clear STALL for IN pipe */
                        usb_hmsc_clear_stall(ptr, g_usb_hmsc_in_pipe[ptr->ip][side], class_trans_result);
                        g_usb_hmsc_in_pipectr[ptr->ip][side] = 0;
                    }
                    return USB_HMSC_CSW_PHASE_ERR;
                break;
                default:
                break;
            }
            return USB_HMSC_CSW_ERR;
        break;
        case USB_DATA_STALL: /* Stall */
            USB_PRINTF1("*** GetCSW Transfer STALL(drive:%d) !\n", side);
            if (USB_ON == usb_hmsc_csw_err_stall[ptr->ip])
            {
                usb_hmsc_csw_err_stall[ptr->ip] = USB_OFF;

                /* Reset */
                usb_hmsc_mass_storage_reset(ptr, g_usb_hmsc_drvno_tbl[side].devadr, usb_hmsc_trans_result);

                /* Clear STALL for OUT pipe */
                usb_hmsc_clear_stall(ptr, g_usb_hmsc_out_pipe[ptr->ip][side], class_trans_result);
                g_usb_hmsc_out_pipectr[ptr->ip][side] = 0;

                /* Clear STALL for IN pipe */
                usb_hmsc_clear_stall(ptr, g_usb_hmsc_in_pipe[ptr->ip][side], class_trans_result);
                g_usb_hmsc_in_pipectr[ptr->ip][side] = 0;
                return USB_HMSC_CSW_PHASE_ERR;
            }
            return USB_HMSC_STALL;
        break;
        case USB_DATA_TMO:
            USB_PRINTF1("### GetCSW Transfer error(drive:%d) !\n", side);
            usb_hstd_transfer_end(ptr, g_usb_hmsc_in_pipe[ptr->ip][side], (uint16_t)USB_DATA_TMO);
        break;
        case USB_DATA_ERR:
            USB_PRINTF1("### GetCSW Transfer ERROR(drive:%d) !\n", side);
        break;
        case USB_DATA_OVR:
            USB_PRINTF1("### GetCSW receive over(drive:%d) !\n", side);
        break;
        default:
            USB_PRINTF1("### GetCSW Transfer error(drive:%d) !\n", side);
        break;
    }

    return USB_HMSC_CSW_ERR;
#endif /* (BSP_CFG_RTOS_USED) */
    return err;
}
/******************************************************************************
 End of function usb_hmsc_get_csw
 ******************************************************************************/

#if (BSP_CFG_RTOS_USED == 0)
/******************************************************************************
 Function Name   : usb_hmsc_get_csw_check
 Description     : Check Receive CSW
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure
                 : uint16_t     side        : Drive Number
                 : uint16_t     result      : Transfer Result
 Return value    : uint16_t                 : Error Code
 ******************************************************************************/
static uint16_t usb_hmsc_get_csw_check (usb_utr_t *ptr, uint16_t side, uint16_t result)
{
    uint32_t    request_size;

    ptr->tranlen = 0;
    ptr->status = g_usb_hmsc_csw[ptr->ip][side].dcsw_status;

    switch (result)
    {
        case USB_DATA_SHT :

            /* Continue */
        case USB_DATA_OK :
            g_usb_hmsc_in_pipectr[ptr->ip][side] = usb_hmsc_receive_data[ptr->ip][side].pipectr;

            request_size = g_usb_hmsc_cbw[ptr->ip][side].dcbw_dtl_lo;
            request_size |= (g_usb_hmsc_cbw[ptr->ip][side].dcbw_dtl_ml << 8);
            request_size |= (g_usb_hmsc_cbw[ptr->ip][side].dcbw_dtl_mh << 16);
            request_size |= (g_usb_hmsc_cbw[ptr->ip][side].dcbw_dtl_hi << 24);
            ptr->tranlen = request_size - g_usb_hmsc_cmd_data_length[ptr->ip];

            /* CSW Check */
            if (USB_MSC_CSW_SIGNATURE != g_usb_hmsc_csw[ptr->ip][side].dcsw_signature)
            {
                USB_PRINTF2("### CSW signature error 0x%08x:SIGN=0x%08x.\n",
                        g_usb_hmsc_csw[ptr->ip][side].dcsw_signature, USB_MSC_CSW_SIGNATURE);
                return USB_HMSC_CSW_ERR;
            }
            if (g_usb_hmsc_csw[ptr->ip][side].dcsw_tag != g_usb_hmsc_cbw[ptr->ip][side].dcbw_tag)
            {
                USB_PRINTF2("### CSW Tag error 0x%08x:CBWTAG=0x%08x.\n",
                        g_usb_hmsc_csw[ptr->ip][side].dcsw_tag, g_usb_hmsc_cbw[ptr->ip][side].dcbw_tag);
                return USB_HMSC_CSW_ERR;
            }
            switch (g_usb_hmsc_csw[ptr->ip][side].dcsw_status)
            {
                case USB_MSC_CSW_OK :
                    return USB_HMSC_OK;
                break;
                case USB_MSC_CSW_NG :
                    return USB_HMSC_CSW_ERR;
                break;
                case USB_MSC_CSW_PHASE_ERR :
                    return USB_HMSC_CSW_PHASE_ERR;
                break;
                default :
                break;
            }
            return USB_HMSC_CSW_ERR;
        break;
        case USB_DATA_STALL :

            /* Stall */
            USB_PRINTF1("*** GetCSW Transfer STALL(drive:%d) !\n", side);
            return USB_HMSC_STALL;
        break;
        case USB_DATA_ERR :
            USB_PRINTF1("### GetCSW Transfer ERROR(drive:%d) !\n", side);
        break;
        case USB_DATA_OVR :
            USB_PRINTF1("### GetCSW receive over(drive:%d) !\n", side);
        break;
        default :
            USB_PRINTF1("### GetCSW Transfer error(drive:%d) !\n", side);
        break;
    }
    return USB_HMSC_CSW_ERR;
}
/******************************************************************************
 End of function usb_hmsc_get_csw_check
 ******************************************************************************/
#endif /* (BSP_CFG_RTOS_USED == 0) */

/******************************************************************************
 Function Name   : usb_hmsc_clear_stall
 Description     : Clear Stall
 Arguments       : usb_utr_t    *ptr        : Pointer to usb_utr_t structure
                 : uint16_t     pipe        : Pipe number
                 : usb_cb_t     complete    : Callback function
 Return value    : uint16_t
 ******************************************************************************/
static usb_er_t usb_hmsc_clear_stall (usb_utr_t *ptr, uint16_t pipe, usb_cb_t complete)
{
    usb_er_t err;

#if (BSP_CFG_RTOS_USED)
    err = usb_hstd_clr_stall(ptr, pipe, complete);
    if (USB_OK == err)
    {

