renesas/amazon-freertos/demos/renesas/rx65n-rsk-uart-esp32/e2studio/ccrx/boot_loader/src/smc_gen/r_usb_hmsc/src/r_usb_hmsc_driver.c
        /* Clear STALL pipe 0 */
        usb_cstd_clr_stall(ptr, (uint16_t)USB_PIPE0);

        /* SQCLR */
        usb_hstd_change_device_state(ptr, usb_hstd_dummy_function, USB_DO_CLR_SQTGL, (uint16_t)USB_PIPE0);
    }

#else
    err = usb_hstd_change_device_state(ptr, complete, USB_DO_CLR_STALL, pipe);
#endif /* (BSP_CFG_RTOS_USED) */

    return err;
}
/******************************************************************************
 End of function usb_hmsc_clear_stall
 ******************************************************************************/

#if (BSP_CFG_RTOS_USED == 0)
/******************************************************************************
 Function Name   : usb_hmsc_std_req_check
 Description     : Sample Standard Request Check
 Arguments       : uint16_t result        : Transfer Result
 Return value    : uint16_t               : error info
 ******************************************************************************/
static uint16_t usb_hmsc_std_req_check (uint16_t result)
{
    if (USB_DATA_STALL == result)
    {
        USB_PRINTF0("*** Standard Request STALL !\n");
        return USB_ERROR;
    }
    else if (USB_CTRL_END != result)
    {
        USB_PRINTF0("*** Standard Request error !\n");
        return USB_ERROR;
    }
    else
    {
        /* Non */
    }
    return USB_OK;
}
/******************************************************************************
 End of function usb_hmsc_std_req_check
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_class_check_result
 Description     : Hub class check result
 Arguments       : usb_utr_t    *mess       : Pointer to usb_utr_t structure
                 : uint16_t     data1       : Not used
                 : uint16_t     data2       : Not used
 Return value    : none
 ******************************************************************************/
static void usb_hmsc_class_check_result (usb_utr_t *mess, uint16_t data1, uint16_t data2)
{
    usb_utr_t *pblf;
    usb_er_t err;

    /* Get mem pool blk */
    if (USB_OK == USB_PGET_BLK (USB_HMSC_MPL, &pblf))
    {
        pblf->msginfo = USB_MSG_CLS_INIT;
        pblf->keyword = mess->keyword;
        pblf->result = mess->status;

        pblf->ip = mess->ip;
        pblf->ipp = mess->ipp;

        USB_PRINTF0("### usb_hmsc_class_check_resultn snd_msg \n");

        /* Send message */
        err = USB_SND_MSG(USB_HMSC_MBX, (usb_msg_t* )pblf);
        if (USB_OK != err)
        {
            err = USB_REL_BLK(USB_HMSC_MPL, (usb_mh_t )pblf);
            USB_PRINTF0("### usb_hmsc_class_check_resultn snd_msg error\n");
        }
    }
    else
    {
        /* Error */
        while (1)
        {
            /* error */
        }
    }
}
#endif /* (BSP_CFG_RTOS_USED == 0) */
/******************************************************************************
 End of function usb_hmsc_class_check_result
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_pipe_info
 Description     : Pipe Information
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure
                 : uint8_t      *table  : Pointer to the pipe information table
                 : uint16_t     side    : Drive number
                 : uint16_t     speed   : USB speed
                 : uint16_t     length  : Data size
 Return value    : uint16_t : 
 ******************************************************************************/
uint16_t usb_hmsc_pipe_info (usb_utr_t *ptr, uint8_t *table, uint16_t side, uint16_t speed, uint16_t length)
{
    uint16_t epcnt = 0;
    uint16_t ofdsc;
    uint16_t ip;
    uint8_t *pdescriptor;
    usb_utr_t   devadr;

    ip = ptr->ip;
    if (USB_DT_INTERFACE != table[1]) /* Check Descriptor */
    {
        USB_PRINTF0("### Not Interface pdescriptor.\n"); /* Configuration Descriptor */
        return USB_ERROR;
    }

    ofdsc = table[0]; /* Check Endpoint Descriptor */
    g_usb_hmsc_out_pipe[ip][side] = USB_NOPORT; /* Pipe initial */
    g_usb_hmsc_in_pipe[ip][side] = USB_NOPORT;
    while (ofdsc < (length - table[0]))
    {
        if (USB_DT_ENDPOINT == table[ofdsc + 1]) /* Search within Interface */
        {
            if (USB_EP_BULK == (table[ofdsc + 3] & USB_EP_TRNSMASK)) /* Bulk Endpoint */
            {
                pdescriptor = &table[ofdsc];

                usb_hmsc_smp_drive2_addr (side, &devadr);           /* Get USB Device address -> "devadr.keyword" */

                if (USB_EP_IN == (pdescriptor[2] & USB_EP_DIRMASK))
                {
                    g_usb_hmsc_in_pipe[ip][side] = usb_hstd_make_pipe_reg_info (ip, devadr.keyword, USB_HMSC, speed,
                                                             pdescriptor, &g_usb_hmsc_pipe_table[side][USB_PIPE_DIR_IN]);
                }
                else
                {
                    g_usb_hmsc_out_pipe[ip][side] = usb_hstd_make_pipe_reg_info (ip, devadr.keyword, USB_HMSC, speed,
                                                             pdescriptor, &g_usb_hmsc_pipe_table[side][USB_PIPE_DIR_OUT]);
                }

                if ((USB_NOPORT != g_usb_hmsc_in_pipe[ip][side]) && (USB_NOPORT != g_usb_hmsc_out_pipe[ip][side]))
                {
                    return USB_OK;
                }
                epcnt++;
                if (epcnt >= 2)
                {
                    USB_PRINTF0("### Endpoint Descriptor error.\n");
                    return USB_ERROR;
                }
            }
        }
        ofdsc += table[ofdsc];
    }
    return USB_ERROR;
}
/******************************************************************************
 End of function usb_hmsc_pipe_info
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_configured
 Description     : Callback function for MSC device configured
 Arguments       : usb_utr_t    *ptr    : Pointer to usb_utr_t structure
                 : uint16_t     devadr  : Device Address
                 : uint16_t     data2   : Not used
 Return value    : none
 ******************************************************************************/
static void usb_hmsc_configured (usb_utr_t *ptr, uint16_t devadr, uint16_t data2)
{
    uint16_t ret;
    uint16_t side;

    ret = usb_hmsc_strg_drive_open(ptr, devadr, &side);
    if (USB_ERROR == ret)
    {
        USB_PRINTF1("### usb_hmsc_strg_drive_open error (%x)\n", ret);
        usb_hstd_connect_err_event_set(ptr->ip);
    }
    
#if (BSP_CFG_RTOS_USED == 1)
    xSemaphoreTake(SemaphoreHandleRead, portMAX_DELAY);
    usb_hmsc_strg_drive_search(ptr, devadr, (usb_cb_t)usb_hmsc_drive_complete);
    xSemaphoreGive(SemaphoreHandleRead);
#endif  /* BSP_CFG_RTOS_USED == 1 */
    
