renesas/amazon-freertos/demos/renesas/rx65n-rsk-uart-esp32/e2studio/ccrx/boot_loader/src/smc_gen/r_usb_hmsc/src/r_usb_hmsc_driver.c
}
/******************************************************************************
 End of function usb_hmsc_message_retry
 ******************************************************************************/
#endif /* (BSP_CFG_RTOS_USED == 0) */

/******************************************************************************
 Function Name   : usb_hmsc_smp_drive2_addr
 Description     : Retrieves device address
 Arguments       : uint16_t     side    : Drive number
                 : usb_utr_t    *devadr : Pointer to usb_utr_t structure
 Return value    : uint16_t             : Device address
 ******************************************************************************/
void usb_hmsc_smp_drive2_addr (uint16_t side, usb_utr_t *devadr)
{
    devadr->keyword = g_usb_hmsc_drvno_tbl[side].devadr; /* Device Address */
    devadr->ip = g_usb_hmsc_drvno_tbl[side].ip; /* USB IP No.     */
    devadr->ipp = usb_hstd_get_usb_ip_adr(devadr->ip);
}
/******************************************************************************
 End of function usb_hmsc_smp_drive2_addr
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_strg_cmd_complete
 Description     : Serial state receive complete call-back.
 Argument        : usb_utr_t    *mess   : Pointer to usb_utr_t structure
                 : uint16_t     devadr  : Device address
                 : uint16_t     data2   : Not used
 Return          : none
 ******************************************************************************/
void usb_hmsc_strg_cmd_complete (usb_utr_t *mess, uint16_t devadr, uint16_t data2)
{
#if (BSP_CFG_RTOS_USED == 0)
    usb_ctrl_t ctrl;

    ctrl.module = mess->ip; /* Module number setting */
    ctrl.pipe = mess->keyword; /* Pipe number setting */
    ctrl.address = usb_hstd_get_devsel(mess, ctrl.pipe) >> 12;
    ctrl.size = 0;

    switch (mess->result)
    {
        case USB_HMSC_OK:
            ctrl.size = mess->tranlen;
            ctrl.status = USB_CSW_SUCCESS;
        break;

        case USB_HMSC_CSW_ERR:
            ctrl.status = USB_CSW_FAIL;
        break;

        case USB_HMSC_CSW_PHASE_ERR:
            ctrl.status = USB_CSW_PHASE;
        break;

        default:
            ctrl.status = USB_CSW_FAIL;
        break;
    }
#if (BSP_CFG_RTOS_USED == 1)
    ctrl.p_data = (void *)mess->cur_task_hdl;
#endif /* (BSP_CFG_RTOS_USED == 1) */

    usb_set_event(USB_STS_MSC_CMD_COMPLETE, &ctrl); /* Set Event(USB receive complete)  */
#endif  /* BSP_CFG_RTOS_USED == 0 */
} /* End of function usb_hmsc_strg_cmd_complete() */

#if (BSP_CFG_RTOS_USED)
/******************************************************************************
 Function Name   : usb_hmsc_get_string_info
 Description     : Get string descriptors.
 Argument        : usb_utr_t *ptr   : USB system internal structure. Selects channel.
                   uint16_t addr
                   uint16_t string
 Return value    : none
 ******************************************************************************/
uint16_t usb_hmsc_get_string_info(usb_utr_t *mess, uint16_t addr, uint16_t string)
{
    uint16_t retval;

    /* Send GetDescriptor(String) */
    retval = usb_hmsc_get_string_desc(mess, addr, (uint16_t)0, usb_hmsc_req_trans_result);
    if (USB_OK != retval)
    {
        return USB_ERROR;
    }

    /* Send GetDescriptor(String) */
    retval = usb_hmsc_get_string_desc(mess, addr, (uint16_t)string, usb_hmsc_req_trans_result);
    if (USB_OK != retval)
    {
        return USB_ERROR;
    }

    return USB_OK;
} /* End of function usb_hmsc_get_string_info() */

/******************************************************************************
 Function Name   : usb_hmsc_req_trans_result
 Description     : Send a message to notify the result of the hmsc class request (PIPE0).
 Argument        : usb_utr_t *ptr   : USB system internal structure. Selects channel.
                   uint16_t data1
                   uint16_t data2
 Return value    : none
 ******************************************************************************/
void usb_hmsc_req_trans_result(usb_utr_t *mess, uint16_t data1, uint16_t data2)
{
    usb_er_t err;

#if BSP_CFG_RTOS_USED == 1
    gs_usb_hmsc_req_tran_result_msg = *mess;

    /* Send a message to HMSC mailbox */
    err = USB_SND_MSG(USB_HMSC_REQ_MBX, (usb_msg_t *)&gs_usb_hmsc_req_tran_result_msg);
#else  /* BSP_CFG_RTOS_USED == 1 */
    err = USB_SND_MSG(USB_HMSC_REQ_MBX, (usb_msg_t *)mess);
#endif /* BSP_CFG_RTOS_USED == 1 */
    if (USB_OK != err)
    {
        USB_PRINTF1("### HMSC snd_msg error (%ld)\n", err);
    }
} /* End of function usb_hmsc_req_trans_result() */

/******************************************************************************
 Function Name   : usb_hmsc_req_trans_wait_tmo
 Description     : Receive the result of the hmsc class request with a timeout (PIPE0).
 Argument        : usb_utr_t *ptr   : USB system internal structure. Selects channel.
                   uint16_t tmo     : Time-out value.
 Return value    : USB_OK/USB_ERROR
 ******************************************************************************/
uint16_t usb_hmsc_req_trans_wait_tmo(uint16_t tmo)
{
    usb_utr_t *mess;
    usb_er_t err;

    /* Receive message from HMSC_REQ mailbox with time-out */
    err = USB_TRCV_MSG(USB_HMSC_REQ_MBX, (usb_msg_t **)&mess, (usb_tm_t)tmo);
    if (USB_OK != err)
    {
        USB_PRINTF1("### HMSC trcv_msg error (%ld)\n", err);
        return USB_ERROR;
    }

    return (mess->status);
} /* End of function usb_hmsc_req_trans_wait_tmo() */

/******************************************************************************
 Function Name   : usb_hmsc_trans_result
 Description     : Send a message to notify the result of the hmsc class request.
 Argument        : usb_utr_t *ptr   : USB system internal structure. Selects channel.
                   uint16_t data1
                   uint16_t data2
 Return value    : none
 ******************************************************************************/
void usb_hmsc_trans_result(usb_utr_t *mess, uint16_t data1, uint16_t data2)
{
    usb_er_t err;

#if BSP_CFG_RTOS_USED == 1
    gs_usb_hmsc_tran_result_msg = *mess;

    /* Send a message to HMSC mailbox */
    err = USB_SND_MSG(USB_HMSC_MBX, (usb_msg_t *)&gs_usb_hmsc_tran_result_msg);
#else  /* BSP_CFG_RTOS_USED == 1 */
    err = USB_SND_MSG(USB_HMSC_MBX, (usb_msg_t *)mess);
#endif /* BSP_CFG_RTOS_USED == 1 */
    if (USB_OK != err)
    {
        USB_PRINTF1("### HMSC snd_msg error (%ld)\n", err);
    }
} /* End of function usb_hmsc_trans_result() */

