renesas/amazon-freertos/demos/renesas/rx65n-rsk-uart-esp32/e2studio/ccrx/boot_loader/src/smc_gen/r_usb_hmsc/src/r_usb_hmsc_driver.c
/******************************************************************************
 Function Name   : usb_hmsc_trans_wait_tmo
 Description     : Receive the result of the hmsc class request with a timeout.
 Argument        : usb_utr_t *ptr   : USB system internal structure. Selects channel.
                   uint16_t tmo     : Time-out value.
 Return value    : USB_OK/USB_ERROR
 ******************************************************************************/
uint16_t usb_hmsc_trans_wait_tmo(uint16_t tmo)
{
    usb_utr_t *mess;
    usb_er_t err;

    /* Receive message from HMSC mailbox with time-out */
    err = USB_TRCV_MSG(USB_HMSC_MBX, (usb_msg_t **)&mess, (usb_tm_t)tmo);
    if (USB_OK != err)
    {
        USB_PRINTF1("### HMSC trcv_msg error (%ld)\n", err);
        return USB_ERROR;
    }

    return (mess->status);
} /* End of function usb_hmsc_trans_wait_tmo() */

#endif /* (BSP_CFG_RTOS_USED) */

/******************************************************************************
 Function Name   : usb_hmsc_driver_start
 Description     : USB Host Initialize process
 Argument        : none
 Return          : none
 ******************************************************************************/
void usb_hmsc_driver_start (uint16_t ip_no)
{
    uint16_t i;
    static uint16_t init_flag = 0;

    for (i = 0; i < USB_MAXSTRAGE; i++)
    {
        if (0 == init_flag)
        {       
            g_usb_hmsc_drvno_tbl[i].use_flag = USB_NOUSE;
        }
        else
        {
            if (USB_TRUE == g_usb_hmsc_drvno_tbl[i].use_flag)
            {
                if (ip_no == g_usb_hmsc_drvno_tbl[i].ip)
                {
                    g_usb_hmsc_drvno_tbl[i].use_flag = USB_NOUSE;
                }
            }
        }

        g_usb_hmsc_in_pipe[ip_no][i] = USB_NOPORT;  /* Pipenumber */
        g_usb_hmsc_out_pipe[ip_no][i] = USB_NOPORT; /* Pipenumber */

        g_usb_hmsc_csw_tag_no[ip_no][i] = (uint16_t) 1;

        g_usb_hmsc_cbw[ip_no][i].dcbw_signature = USB_MSC_CBW_SIGNATURE;
        g_usb_hmsc_cbw[ip_no][i].dcbw_tag = g_usb_hmsc_csw_tag_no[ip_no][i];
        g_usb_hmsc_cbw[ip_no][i].dcbw_dtl_lo = 0;
        g_usb_hmsc_cbw[ip_no][i].dcbw_dtl_ml = 0;
        g_usb_hmsc_cbw[ip_no][i].dcbw_dtl_mh = 0;
        g_usb_hmsc_cbw[ip_no][i].dcbw_dtl_hi = 0;
        g_usb_hmsc_cbw[ip_no][i].bm_cbw_flags.cbw_dir = 0;
        g_usb_hmsc_cbw[ip_no][i].bm_cbw_flags.reserved7 = 0;
        g_usb_hmsc_cbw[ip_no][i].bcbw_lun.bcbw_lun = 0;
        g_usb_hmsc_cbw[ip_no][i].bcbw_lun.reserved4 = 0;
        g_usb_hmsc_cbw[ip_no][i].bcbwcb_length.bcbwcb_length = 0;
        g_usb_hmsc_cbw[ip_no][i].bcbwcb_length.reserved3 = 0;

        g_usb_hmsc_cbw[ip_no][i].cbwcb[0] = 0;
        g_usb_hmsc_cbw[ip_no][i].cbwcb[1] = 0;
        g_usb_hmsc_cbw[ip_no][i].cbwcb[2] = 0;
        g_usb_hmsc_cbw[ip_no][i].cbwcb[3] = 0;
        g_usb_hmsc_cbw[ip_no][i].cbwcb[4] = 0;
        g_usb_hmsc_cbw[ip_no][i].cbwcb[5] = 0;
        g_usb_hmsc_cbw[ip_no][i].cbwcb[6] = 0;
        g_usb_hmsc_cbw[ip_no][i].cbwcb[7] = 0;
        g_usb_hmsc_cbw[ip_no][i].cbwcb[8] = 0;
        g_usb_hmsc_cbw[ip_no][i].cbwcb[9] = 0;
        g_usb_hmsc_cbw[ip_no][i].cbwcb[10] = 0;
        g_usb_hmsc_cbw[ip_no][i].cbwcb[11] = 0;
        g_usb_hmsc_cbw[ip_no][i].cbwcb[12] = 0;
        g_usb_hmsc_cbw[ip_no][i].cbwcb[13] = 0;
        g_usb_hmsc_cbw[ip_no][i].cbwcb[14] = 0;
        g_usb_hmsc_cbw[ip_no][i].cbwcb[15] = 0;
    }

#if (BSP_CFG_RTOS_USED == 0)
    usb_cstd_set_task_pri(USB_HMSC_TSK, USB_PRI_3);
    usb_cstd_set_task_pri(USB_HSTRG_TSK, USB_PRI_3);
#endif /* (BSP_CFG_RTOS_USED == 0) */
}
/******************************************************************************
 End of function usb_hmsc_driver_start
 ******************************************************************************/

/******************************************************************************
 Function Name   : usb_hmsc_class_check
 Description     : check connected device
 Arguments       : usb_utr_t *ptr       : Pointer to usb_utr_t structure.
                 : uint16_t **table     : Pointer to the class information table
 Return value    : none
 ******************************************************************************/
void usb_hmsc_class_check (usb_utr_t *ptr, uint16_t **table)
{
#if (BSP_CFG_RTOS_USED)
    uint16_t retval;
    uint16_t iproduct;
#else /* (BSP_CFG_RTOS_USED) */
    usb_utr_t *pblf;
    usb_er_t err;
#endif /* (BSP_CFG_RTOS_USED) */

    g_p_usb_hmsc_device_table[ptr->ip] = (uint8_t*) (table[0]);
    g_p_usb_hmsc_config_table[ptr->ip] = (uint8_t*) (table[1]);
    g_p_usb_hmsc_interface_table[ptr->ip] = (uint8_t*) (table[2]);
    g_usb_hmsc_speed[ptr->ip] = *table[6];
    g_usb_hmsc_devaddr[ptr->ip] = *table[7];
    *table[3] = USB_OK;

#if (BSP_CFG_RTOS_USED)
    /* Check Interface Descriptor (device-class) */
    if (USB_IFCLS_MAS != g_p_usb_hmsc_interface_table[ptr->ip][USB_IF_B_INTERFACECLASS])
    {
        USB_PRINTF1("### Interface deviceclass is %x , not support.\n",
                g_p_usb_hmsc_interface_table[ptr->ip][USB_IF_B_INTERFACECLASS]);
        *table[3] = USB_ERROR;
        return;
    }

    /* Check Interface Descriptor (subclass) */
    g_usb_hmsc_tmp_sub_class[ptr->ip] = g_p_usb_hmsc_interface_table[ptr->ip][USB_IF_B_INTERFACESUBCLASS];
    if (USB_ATAPI == g_usb_hmsc_tmp_sub_class[ptr->ip])
    {
        USB_PRINTF0("    Interface subclass  : SFF-8070i\n");
    }
    else if (USB_SCSI == g_usb_hmsc_tmp_sub_class[ptr->ip])
    {
        USB_PRINTF0(
                "Interface subclass  : SCSI transparent command set\n");
    }
    else if (USB_ATAPI_MMC5 == g_usb_hmsc_tmp_sub_class[ptr->ip])
    {
        USB_PRINTF0("   Interface subclass   : ATAPI command set\n");
    }
    else
    {
        USB_PRINTF1("### Interface subclass is %x , not support.\n", g_usb_hmsc_tmp_sub_class[ptr->ip]);
        *table[3] = USB_ERROR;
        return;
    }

    /* Check Interface Descriptor (protocol) */
    if (USB_BOTP == g_p_usb_hmsc_interface_table[ptr->ip][USB_IF_B_INTERFACEPROTOCOL])
    {
        USB_PRINTF0("   Interface protocol   : BOT \n");
    }
    else
    {
        USB_PRINTF1("### Interface protocol is %x , not support.\n",
                g_p_usb_hmsc_interface_table[ptr->ip][USB_IF_B_INTERFACEPROTOCOL]);
        *table[3] = USB_ERROR;
        return;
    }

    /* Check Endpoint number */
    if (g_p_usb_hmsc_interface_table[ptr->ip][USB_IF_B_NUMENDPOINTS] < 2)
    {
        USB_PRINTF1("### Endpoint number is %x , less than 2.\n",
                g_p_usb_hmsc_interface_table[ptr->ip][USB_IF_B_NUMENDPOINTS]);
        *table[3] = USB_ERROR;
        return;
    }

    /* Get String Descriptors */
    iproduct = g_p_usb_hmsc_device_table[ptr->ip][USB_DEV_I_PRODUCT];
    retval = usb_hmsc_get_string_info(ptr, g_usb_hmsc_devaddr[ptr->ip], iproduct);
    if (USB_OK != retval)
    {
        USB_PRINTF0("   GetDescriptor(String) failed!     \n");
        *table[3] = USB_ERROR;
        return;
    }

